<a href="https://colab.research.google.com/github/princeKike27/Roller-Coaster/blob/main/Roller_Coaster.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# import packages
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# load data
roller_coasters = 'https://raw.githubusercontent.com/princeKike27/Roller-Coaster/main/roller_coasters.csv'
steel_winners = 'https://raw.githubusercontent.com/princeKike27/Roller-Coaster/main/Golden_Ticket_Award_Winners_Steel.csv'
wood_winners = 'https://raw.githubusercontent.com/princeKike27/Roller-Coaster/main/Golden_Ticket_Award_Winners_Wood.csv'

df_coasters = pd.read_csv(roller_coasters)
df_steel = pd.read_csv(steel_winners)
df_wood = pd.read_csv(wood_winners)

In [3]:
# roller coasters
df_coasters.head()

            name material_type  ...            park            status
0       Goudurix         Steel  ...    Parc Asterix  status.operating
1  Dream catcher         Steel  ...   Bobbejaanland  status.operating
2     Alucinakis         Steel  ...    Terra Mítica  status.operating
3       Anaconda        Wooden  ...  Walygator Parc  status.operating
4         Azteka         Steel  ...          Le Pal  status.operating

[5 rows x 10 columns]

In [4]:
# steel gold winners
df_steel.head()

   Rank                Name  ... Points Year of Rank
0     1    Millennium Force  ...   1204         2013
1     2             Bizarro  ...   1011         2013
2     3  Expedition GeForce  ...    598         2013
3     4               Nitro  ...    596         2013
4     5    Apollo’s Chariot  ...    542         2013

[5 rows x 8 columns]

In [5]:
# wooden gold winners
df_wood.head()

   Rank          Name  ... Points Year of Rank
0     1  Boulder Dash  ...   1333         2013
1     2       El Toro  ...   1302         2013
2     3       Phoenix  ...   1088         2013
3     4    The Voyage  ...   1086         2013
4     5   Thunderhead  ...    923         2013

[5 rows x 8 columns]

In [14]:
# number of rollercoasters in each ranking dataset
wood_winners_count = len(df_wood['Name'])
steel_winners_count = len(df_steel['Name'])

print(f'Number of Roller-Coasters in Gold Wood Award Winners: {wood_winners_count}')
print(f'Number of Roller-Coasters in Gold Steel Award Winners: {steel_winners_count}')

Number of Roller-Coasters in Gold Wood Award Winners: 180
Number of Roller-Coasters in Gold Steel Award Winners: 180

In [34]:
# Avg points scored per supplier in each year
wood_suppliers = df_wood.groupby(['Supplier', 'Year of Rank']).Points.mean().reset_index()
wood_suppliers_pivot = wood_suppliers.pivot(
    index = 'Supplier',
    columns = 'Year of Rank',
    values = 'Points'
).reset_index().rename_axis(None,axis=1)


steel_suppliers = df_steel.groupby(['Supplier', 'Year of Rank']).Points.mean().reset_index()
steel_suppliers_pivot = steel_suppliers.pivot(
    index='Supplier',
    columns = 'Year of Rank',
    values = 'Points'
).reset_index().rename_axis(None, axis=1)

In [37]:
wood_suppliers_pivot.head(3)

          Supplier   2013    2014    2015        2016   2017   2018
0        Allen/PTC    NaN     NaN     NaN         NaN    NaN  117.0
1              CCI  818.5  1480.0  1625.0         NaN    NaN    NaN
2  Custom Coasters    NaN     NaN     NaN  283.333333  310.0  285.0

In [38]:
steel_suppliers_pivot.head()

  Supplier    2013        2014        2015        2016        2017   2018
0    Arrow  416.00         NaN         NaN  240.500000  227.500000  231.0
1      B&M  527.50  489.166667  561.666667  251.045455  277.473684  257.9
2   Chance     NaN         NaN         NaN   90.000000   78.000000    NaN
3  Intamin  806.25  984.000000  949.333333  435.500000  451.000000  393.0
4   Lagoon     NaN         NaN         NaN   92.000000  163.000000   92.0